Repository: rishithamenush/moneymaker
Catalog: lib/l10n/app_*.arb
Languages: si

source: Home
si: මුල් පිටුව

source: Overview
si: දළ විශ්ලේෂණය

source: Summary
si: සාරාංශය

source: Charts
si: ප්‍රස්ථාර

source: Trends
si: ප්‍රවණතා

source: Add Transaction
si: ගනුදෙනුවක් එකතු කරන්න

source: Settings
si: සැකසුම්

source: Account
si: ගිණුම

source: Login
si: පුරන්න

source: Register
si: ලියාපදිංචි වන්න

source: Email
si: විද්‍යුත් තැපෑල

source: Password
si: මුරපදය

source: Confirm Password
si: මුරපදය තහවුරු කරන්න

source: Sign In
si: පුරන්න

source: Sign Up
si: ලියාපදිංචි වන්න

source: Sign Out
si: ඉවත් වන්න

source: Forgot Password?
si: මුරපදය අමතකද?

# dontHaveAccount
source: Don't have an account?
si: ගිණුමක් නැද්ද?

# alreadyHaveAccount
source: Already have an account?
si: දැනටමත් ගිණුමක් තිබේද?

source: Amount
si: ප්‍රමාණය

source: Description
si: විස්තරය

source: Category
si: ප්‍රවර්ගය

source: Date
si: දිනය

source: Type
si: වර්ගය

source: Income
si: ආදායම

source: Expense
si: වියදම

source: Save
si: සුරකින්න

source: Cancel
si: අවලංගු කරන්න

source: Delete
si: මකන්න

source: Edit
si: සංස්කරණය කරන්න

source: Total Income
si: මුළු ආදායම

source: Total Expenses
si: මුළු වියදම්

source: Net Amount
si: ශුද්ධ ප්‍රමාණය

source: Recent Transactions
si: මෑත ගනුදෙනු

# noTransactions
source: No transactions found
si: ගනුදෙනු හමු නොවීය

source: Appearance
si: පෙනුම

source: Theme
si: තේමාව

source: Light
si: ලා

source: Dark
si: අඳුරු

source: System
si: පද්ධතිය

source: Accent Color
si: වර්ණය

source: Currency
si: ව්‍යවහාර මුදල්

source: Language
si: භාෂාව

source: Export Data
si: දත්ත අපනයනය

source: Import Data
si: දත්ත ආනයනය

source: About
si: පිළිබඳව

source: Version
si: ප්‍රභේදය

source: Delete Transaction
si: ගනුදෙනුව මකන්න

# deleteTransactionMessage
source: Are you sure you want to delete this transaction?
si: ඔබට මෙම ගනුදෙනුව මකා දැමීමට අවශ්‍ය බවට විශ්වාසද?

# transactionDeleted
source: Transaction deleted successfully
si: ගනුදෙනුව සාර්ථකව මකා දමන ලදී

# transactionSaved
source: Transaction saved successfully
si: ගනුදෙනුව සාර්ථකව සුරකින ලදී

source: Please fill all fields
si: කරුණාකර සියලු ක්ෂේත්‍ර පුරවන්න

# invalidEmail
source: Please enter a valid email
si: කරුණාකර වලංගු විද්‍යුත් තැපෑලක් ඇතුළත් කරන්න

# passwordTooShort
source: Password must be at least 6 characters
si: මුරපදය අවම වශයෙන් අකුරු 6 ක් විය යුතුය

source: Passwords do not match
si: මුරපද ගැලපෙන්නේ නැත

# loginFailed
source: Login failed. Please check your credentials.
si: පුරන්න අසාර්ථකයි. කරුණාකර ඔබේ අක්තපත්‍ර පරීක්ෂා කරන්න.

# registrationFailed
source: Registration failed. Please try again.
si: ලියාපදිංචි වීම අසාර්ථකයි. කරුණාකර නැවත උත්සාහ කරන්න.

source: Welcome back!
si: නැවත සාදරයෙන් පිළිගනිමු!

source: Welcome!
si: සාදරයෙන් පිළිගනිමු!

source: Loading...
si: පූරණය වෙමින්...

source: Error
si: දෝෂය

source: Success
si: සාර්ථකත්වය

source: OK
si: හරි

source: Yes
si: ඔව්

source: No
si: නැහැ

source: Food
si: ආහාර

source: Transport
si: ප්‍රවාහනය

source: Entertainment
si: විනෝදාංශය

source: Shopping
si: සාප්පු සවාරි

source: Health
si: සෞඛ්‍යය

source: Education
si: අධ්‍යාපනය

source: Other
si: වෙනත්

source: Salary
si: වැටුප

source: Freelance
si: නිදහස් වෘත්තිය

source: Investment
si: ආයෝජනය

source: Gift
si: තෑග්ග

source: Business
si: ව්‍යාපාරය

source: Rent
si: කුලිය

source: Budget
si: අයවැය

source: Spent
si: වියදම් කරන ලදී

source: Remaining
si: ඉතිරි

source: Over Budget
si: අයවැය ඉක්මවා

source: Monthly Summary
si: මාසික සාරාංශය

source: Spending Trends
si: වියදම් ප්‍රවණතා

source: Weekly Breakdown
si: සතිපතා විධිභේදය

source: Monthly Comparison
si: මාසික සංසන්දනය

source: This Month
si: මෙම මාසය

source: Last Month
si: පසුගිය මාසය

source: Daily Average
si: දෛනික සාමාන්‍යය

source: Insights
si: අවබෝධයන්

source: Category Totals
si: ප්‍රවර්ග එකතු

# noData
source: No data available
si: දත්ත නොමැත

source: Select Language
si: භාෂාව තෝරන්න

source: English
si: ඉංග්‍රීසි

source: Spanish
si: ස්පාඤ්ඤ

source: French
si: ප්‍රංශ

source: German
si: ජර්මානු

source: Chinese
si: චීන

source: Japanese
si: ජපන්

source: Customize Categories
si: ප්‍රවර්ග අභිරුචිකරණය

# addRenameDeleteCategories
source: Add, rename, or delete your own categories
si: ඔබේම ප්‍රවර්ග එකතු කරන්න, නම් වෙනස් කරන්න, හෝ මකන්න

source: Dark Mode
si: අඳුරු ප්‍රකාරය

source: Light Mode
si: ලා ප්‍රකාරය

source: System Default
si: පද්ධති පෙරනිමිය

source: Choose Accent Color
si: වර්ණය තෝරන්න

source: Choose Currency
si: ව්‍යවහාර මුදල් තෝරන්න

source: Currency & Formatting
si: ව්‍යවහාර මුදල් සහ ආකෘතිකරණය

source: Number Format
si: අංක ආකෘතිය

# decimalPlacesSeparators
source: Decimal places and separators
si: දශම ස්ථාන සහ වෙන්කරන්නන්

source: Data Management
si: දත්ත කළමනාකරණය

# exportTransactionsCSV
source: Export your transactions to CSV
si: ඔබේ ගනුදෙනු CSV වෙත අපනයනය කරන්න

# importTransactionsCSV
source: Import transactions from CSV
si: CSV වෙතින් ගනුදෙනු ආනයනය කරන්න

source: Clear All Data
si: සියලු දත්ත මකන්න

# permanentlyDeleteTransactions
source: Permanently delete all transactions
si: සියලු ගනුදෙනු ස්ථිරව මකන්න

source: Notifications
si: දැනුම්දීම්

source: Budget Alerts
si: අයවැය අනතුරු ඇඟවීම්

# notifiedApproachingBudget
source: Get notified when approaching budget limits
si: අයවැය සීමාවන්ට ළඟා වන විට දැනුම් දෙන්න

source: Daily Reminders
si: දෛනික මතක් කිරීම්

# remindLogDailyExpenses
source: Remind me to log daily expenses
si: දෛනික වියදම් ලොග් කිරීමට මට මතක් කරන්න

source: App Version
si: යෙදුමේ ප්‍රභේදය

source: Privacy Policy
si: පෞද්ගලිකත්ව ප්‍රතිපත්තිය

# howWeHandleData
source: How we handle your data
si: අපි ඔබේ දත්ත හැසිරවීමේ ආකාරය

source: Terms of Service
si: සේවා නියමයන්

source: Terms and conditions
si: නියමයන් සහ කොන්දේසි

# signOutAccount
source: Sign out of your account
si: ඔබේ ගිණුමෙන් ඉවත් වන්න

source: Logout
si: ඉවත් වන්න

# sureWantLogout
source: Are you sure you want to logout?
si: ඔබට ඉවත් වීමට අවශ්‍ය බවට විශ්වාසද?

source: Delete All
si: සියල්ල මකන්න

source: Close
si: ඔබන්න

source: Select
si: තෝරන්න

# pickColor
source: Pick a color
si: වර්ණයක් තෝරන්න

source: Create new category
si: නව ප්‍රවර්ගයක් සාදන්න

source: Category name
si: ප්‍රවර්ග නම

# pickColorButton
source: Pick color
si: වර්ණය තෝරන්න

source: Add
si: එකතු කරන්න

source: Export feature coming soon!
si: අපනයන විශේෂාංගය ඉක්මනින් පැමිණෙනු ඇත!

source: Import feature coming soon!
si: ආනයන විශේෂාංගය ඉක්මනින් පැමිණෙනු ඇත!

# numberFormattingComingSoon
source: Number formatting options coming soon!
si: අංක ආකෘතිකරණ විකල්ප ඉක්මනින් පැමිණෙනු ඇත!

source: Clear data feature coming soon!
si: දත්ත මැකීමේ විශේෂාංගය ඉක්මනින් පැමිණෙනු ඇත!

source: Budget alerts enabled
si: අයවැය අනතුරු ඇඟවීම් සක්‍රියයි

source: Budget alerts disabled
si: අයවැය අනතුරු ඇඟවීම් අක්‍රියයි

source: Daily reminders enabled
si: දෛනික මතක් කිරීම් සක්‍රියයි

source: Daily reminders disabled
si: දෛනික මතක් කිරීම් අක්‍රියයි

source: Logged out successfully
si: සාර්ථකව ඉවත් විය

source: Logout failed
si: ඉවත් වීම අසාර්ථකයි

# appDescription
source: A simple and elegant money management app to help you track your income and expenses.
si: ඔබේ ආදායම් සහ වියදම් ලුහුබැඳීමට උපකාර කරන සරල හා අලංකාර මුදල් කළමනාකරණ යෙදුමකි.

source: Features:
si: විශේෂාංග:

# trackIncomeExpenses
source: Track income and expenses
si: ආදායම් සහ වියදම් ලුහුබැඳීම

# monthlyDailyViews
source: Monthly and daily views
si: මාසික සහ දෛනික දර්ශන

source: Category management
si: ප්‍රවර්ග කළමනාකරණය

source: Budget tracking
si: අයවැය ලුහුබැඳීම

source: Data visualization
si: දත්ත දෘශ්‍යකරණය

source: Multi-currency support
si: බහු මුදල් ඒකක සහාය

source: Dark/Light theme support
si: අඳුරු/ලා තේමා සහාය

# privacyPolicyContent
source: Your privacy is important to us. All your data is stored locally on your device and is not shared with any third parties. We do not collect, store, or transmit any personal information. Your financial data remains private and secure on your device.
si: ඔබේ පෞද්ගලිකත්වය අපට වැදගත්ය. ඔබේ සියලු දත්ත ඔබේ උපාංගයේ ස්ථානිකව ගබඩා කර ඇති අතර කිසිදු තෙවන පාර්ශවයක් සමඟ බෙදා නොගනී. අපි කිසිදු පුද්ගලික තොරතුරු එකතු, ගබඩා හෝ සම්ප්‍රේෂණය නොකරමු. ඔබේ මූල්‍ය දත්ත ඔබේ උපාංගයේ පුද්ගලික සහ ආරක්ෂිතව පවතී.

# termsOfServiceContent
source: By using Money Maker, you agree to the following terms: 1. This app is provided "as is" without warranties. 2. You are responsible for backing up your data. 3. We are not liable for any data loss. 4. You may not reverse engineer or redistribute this app. These terms may be updated from time to time.
si: Money Maker භාවිතා කිරීමෙන්, ඔබ පහත නියමයන්ට එකඟ වේ: 1. මෙම යෙදුම වගකීම් නොමැතිව "පවතින ආකාරයෙන්" සපයනු ලැබේ. 2. ඔබේ දත්ත උපස්ථ කිරීම ඔබේ වගකීමයි. 3. කිසිදු දත්ත අහිමි වීමකට අපි වගකිව නොයුතුය. 4. ඔබට මෙම යෙදුම ප්‍රතිලෝම ඉංජිනේරු කිරීමට හෝ නැවත බෙදා හැරීමට නොහැකිය. මෙම නියමයන් කාලයෙන් කාලයට යාවත්කාලීන කළ හැක.

# clearAllDataConfirmation
source: This will permanently delete all your transactions, budgets, and categories. This action cannot be undone.
si: මෙය ඔබේ සියලු ගනුදෙනු, අයවැය සහ ප්‍රවර්ග ස්ථිරව මකා දමනු ඇත. මෙම ක්‍රියාව අහෝසි කළ නොහැක.

source: Delete All Data
si: සියලු දත්ත මකන්න
